PIM_III/02_Modelagem_UML_Astah/UC02_Cadastrar_Usuario/README.md
```mermaid
sequenceDiagram
    autonumber
    participant V as :Visitante
    participant C as :ServicoAutenticacao
    participant A as :Aluno
    V->>C: registrar(dados)
    activate C
    C-->>A: <<create>>
    activate A
    A->>A: inicializarPerfil()
    deactivate A
    C-->>V: Cadastro Confirmado
    deactivate C
```
